#todo: Напишите программу, которая:
# Получает на вход две строки, в которых перечисляются книги, прочитанные двумя учениками.
# Выводит количество книг, которые прочитали оба ученика.
# Пример ввода:
# Война и мир, Над пропастью во ржи, Мастер и Маргарита, Идиот
# Евгений Онегин, Идиот, Мастер и Маргарита, Война и мир

booklist = """Война и мир, Над пропастью во ржи, Мастер и Маргарита, Идиот
Евгений Онегин, Идиот, Мастер и Маргарита, Война и мир
"""

booklist = booklist.replace("\n", ",")
test = booklist.split(",")

print(len(test))