#Единицы массы пронумерованы следующим образом: 1 — килограмм, 2 — миллиграмм, 3 — грамм, 4 — тонна, 5 — центнер.
#Дан номер единицы массы и масса тела M в этих единицах (вещественное число). Вывести массу данного тела в килограммах.
# Данную задачу нужно решить с помощью конструкции  match  (Python v3.10)


# Пример:
# Введите единицу массы тела
#       1 - килограмм
#       2 — миллиграмм
#       3 — грамм
#       4 — тонна
#       5 — центнер
#>4

#Введите  массу тела
#>1

typeValue = int(input())
value = int(input())
weightKilo = 0

match(typeValue):
    case 1:#       1 - килограмм
        weightKilo = value
    case 2:#       2 — миллиграмм
        weightKilo = value // 1000000
    case 3:#       3 — грамм
        weightKilo = value // 1000
    case 4:#       4 — тонна
        weightKilo = value * 1000
    case 5:#       5 — центнер
        weightKilo = value * 100
    case _:
        print("Unknoewn type")


print("Ответ: %d кг" % weightKilo)

